umbertomazzucchelli/LTEBS_project/PSoC Code/AY2122_II/Project4.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "UART_BT.h"
#include "timer_clock.h"
#include "Timer_LED.h"
#include "isr_LED.h"
#include "I2C_Master.h"
#include "I2C_Master_PVT.h"
#include "Pin_LED_aliases.h"
#include "Pin_LED.h"
#include "SDA_aliases.h"
#include "SDA.h"
#include "SCL_aliases.h"
#include "SCL.h"
#include "UART.h"
#include "Pin_INT_aliases.h"
#include "Pin_INT.h"
#include "clock_read.h"
#include "Timer_read.h"
#include "isr_read.h"
#include "isr_RX.h"
#include "UART_BT_IntClock.h"
#include "UART_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

